// Разработать метод для формирования массива и метод для расчета среднего арифметического всех чисел в массиве
// (в методах сделать искусственную задержку - имитация длительных вычислений).
// В методе Main выполнить проверку работы методов 2мя способами - сначала используя задачи продолжения,
// затем - с помощью async/await.

namespace Task_01
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
